Revit 2027 API
ParameterTypeId.StructuralAttachmentBaseRatio Property
 "Base Attachment Ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentBaseRatio { get; }
Public Shared ReadOnly Property StructuralAttachmentBaseRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentBaseRatio {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentBaseRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace